{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "8750ec22",
   "metadata": {},
   "source": [
    "Пусть прибыль в вашей компании выражается следующей функцией, которая зависит от параметра x — количества производимых товаров:\n",
    "$$\n",
    "f(x) = -x^4 + 6x^3 - 4x^2 + 80\n",
    "$$\n",
    "Найдите максимально возможную прибыль, которую вы можете получить, варьируя количество произведённых товаров."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 45,
   "id": "f816e062",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "-4*x**3 + 18*x**2 - 8*x\n",
      "[0, 1/2, 4] <class 'list'>\n"
     ]
    }
   ],
   "source": [
    "from sympy import *\n",
    "x = Symbol('x')\n",
    "f = -x**4 + 6*x**3 - 4*x**2 + 80\n",
    "f_diff = diff(f, x)\n",
    "eq_diff = Eq(f_diff, 0)\n",
    "result = solve(eq_diff, x)\n",
    "\n",
    "print(f_diff)\n",
    "print(result, type(result))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 55,
   "id": "e7d0e03d",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      " max прибыль 80.0\n",
      " max прибыль 79.6875\n",
      " max прибыль 144.0\n"
     ]
    }
   ],
   "source": [
    "# максимально возможную прибыль\n",
    "for i in result:\n",
    "    prib = f.subs(x, i)\n",
    "    print(f' max прибыль {float(prib)}')"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "020a7abd",
   "metadata": {},
   "source": [
    "Допустим, вы хотите произвести некоторое количество товара, которое зависит от часов работы двух ключевых сотрудников следующим образом:\n",
    "$$\n",
    "f(x, y) = x^2 + 2y^2\n",
    "$$\n",
    "где  — время работы 1-ого сотрудника,  — время работы 2-ого сотрудника.  \n",
    "Однако вы должны оплатить этим сотрудникам ровно 20 часов работы в сумме, то есть:\n",
    "$$\n",
    "x + y = 20\n",
    "$$\n",
    "Какое наибольшее количество товаров вы сможете произвести в таком случае?"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 88,
   "id": "951de236",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{l: -80/3, x: 40/3, y: 20/3}\n",
      "13\n",
      "7\n",
      "267\n"
     ]
    }
   ],
   "source": [
    "x, y, l = symbols('x, y, l', real=True)\n",
    "f = x**2 + 2*y**2\n",
    "f_lim = x + y - 20\n",
    "f_lagra = f + l * f_lim\n",
    "\n",
    "x_diff = diff(f_lagra, x)\n",
    "y_diff = diff(f_lagra, y)\n",
    "l_diff = diff(f_lagra, l)\n",
    "\n",
    "solv = solve([x_diff, y_diff, l_diff], x, y, l)\n",
    "print(solv)\n",
    "print(round(float(solv[x])))\n",
    "print(round(float(solv[y])))\n",
    "\n",
    "resul = f_lagra.subs(x, round(float(solv[x]))).subs(y, round(float(solv[y]))).subs(l, round(float(solv[l])))\n",
    "print(resul)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.13.1"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
